muness/roon-knob/frame_app/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Runtime flash mode (boot image header remains DIO per ESP-IDF)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Main task stack (needs headroom for display + PMIC init)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM Configuration (required for artwork buffers + framebuffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# Required by the explicitly PSRAM-backed, network-only bridge worker stack.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# WiFi memory optimization
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16

# Network identity
CONFIG_LWIP_LOCAL_HOSTNAME="hiphi-frame"
CONFIG_LWIP_NETIF_HOSTNAME=y

# Brownout detection - lower threshold for battery operation
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4=y
CONFIG_ESP_BROWNOUT_DET_LVL=4
CONFIG_BROWNOUT_DET_LVL_SEL_4=y
CONFIG_ESP32S3_BROWNOUT_DET_LVL_SEL_4=y
CONFIG_BROWNOUT_DET_LVL=4
CONFIG_ESP32S3_BROWNOUT_DET_LVL=4

# System event task needs more stack for WiFi + captive portal callbacks
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# HTTP Server - larger header buffer for captive portal
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# Console via UART (USB_SERIAL_JTAG causes flash reliability issues)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Bluetooth (NimBLE BLE HID Host for media remote)
CONFIG_RK_BLE_HID_HOST=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_SC=y
# Required: nimble_hidh.c gates on this config (despite the name, it enables HID host too)
CONFIG_BT_NIMBLE_HID_SERVICE=y
# Frame uses the same single-remote central HID profile as Dial. Dynamic
# NimBLE allocations use PSRAM; stacks that can touch NVS remain internal.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
## ESP-IDF's esp_hid BLE-host source is conditionally compiled behind the
## HID-service setting, which itself requires GATT server/peripheral.  These
## are therefore the minimum compatibility roles for its HID client wrapper;
## the firmware does not advertise a local HID device.
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
# ESP-IDF 5.5's NVS bond-store implementation indexes i + 1 while sorting;
# a one-entry array trips -Werror=array-bounds.  Two is its safe minimum.
CONFIG_BT_NIMBLE_MAX_BONDS=2
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_CCCDS=2
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=128
CONFIG_BT_NIMBLE_ATT_MAX_PREP_ENTRIES=4
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=2
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=6
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=128
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=8
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=192
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=8
CONFIG_BT_NIMBLE_TRANSPORT_ACL_SIZE=128
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=10
CONFIG_BT_NIMBLE_TRANSPORT_EVT_DISCARD_COUNT=4
CONFIG_BT_NIMBLE_PROX_SERVICE=n
CONFIG_BT_NIMBLE_ANS_SERVICE=n
CONFIG_BT_NIMBLE_CTS_SERVICE=n
CONFIG_BT_NIMBLE_HTP_SERVICE=n
CONFIG_BT_NIMBLE_IPSS_SERVICE=n
CONFIG_BT_NIMBLE_TPS_SERVICE=n
CONFIG_BT_NIMBLE_IAS_SERVICE=n
CONFIG_BT_NIMBLE_LLS_SERVICE=n
CONFIG_BT_NIMBLE_SPS_SERVICE=n
CONFIG_BT_NIMBLE_HR_SERVICE=n
CONFIG_BT_NIMBLE_BAS_SERVICE=n
CONFIG_BT_NIMBLE_DIS_SERVICE=n
